import React from "react";

import { Text } from "../../atoms/Text/";
import { Title } from "../../atoms/Title/";
import { SubTitle } from "../../atoms/SubTitle/";
import { Outer } from "./element";

export const ParagraphWithCenteredElements = props => {
  return (
    <Outer>
      <Title isBold={true}> Title</Title>
      <SubTitle isBold={true}> SubTitle</SubTitle>
      <Text>
        {
          "　size24pxTeeeeeet日本語もあああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ"
        }
      </Text>
    </Outer>
  );
};
